Revit 2024 API
Toposolid.Simplify Method
 Simplifies the toposolid by reducing the number of inner vertices to the given percentage.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public void Simplify(
	double percentage
)
Visual Basic
Public Sub Simplify ( _
	percentage As Double _
)
Visual C++
public:
void Simplify(
	double percentage
)
Parameters
percentage
Type: System.Double
 The ratio of the number of inner vertices after simplify to the original number.
Remarks
 At low percentages, the inner vertices may not be reduced to the exact percentage to keep a rough semblance of the original shape. Call this method again if you want to keep removing inner vertices.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The input percentage should be greater than 0 and less than 1.
Autodesk.Revit.Exceptions.InvalidOperationException |  this operation failed.
See Also
Toposolid Class
Autodesk.Revit.DB Namespace